/* Задача 9.
Напишете по 2 тройни цикъла (един и същи код) за масивите.
Хайде да го изнесем във функция. */
#include <stdio.h>
#define LEN 10

/* Не се разбира ясно какво се иска в задачата. 
Разбирам я като да демонстрирам как се принтира троен масив. */
void print3d(int a[LEN][LEN][LEN]) {
	int i, j, k;

	for (i = 0; i < LEN; i++) {
		for (j = 0; j < LEN; j++) {
			for (k = 0; k < LEN; k++){
				printf("%d ", a[i][j][k]);
			}
		}
	}
}

int main(void) {
	

	return 0;
}