/* Задача 7. Напишете заглавен файл с декларации на функции и
сложете гардове. Този начин намалява времето за компилиране на
големи проекти. */
#include "myheader.h"

int main(void) {
	printf("PI value: %.6f\n", PI);
	printf("MY favourite number is %d\n", MYNUMBER);

	return 0;
}