/* Задача 7. Дефинирайте масив int с 10 елемента. Дефинирайте
пойнтер, който ще сочи към масива. Насочете пойнтера към масива. Нужно
ли е да използвате &? Какво представлява името на масива? Какво сочи?
Колко начина има за да изпишете насочването на пойнтера към масива.
Има ли разлика между тях? */
#include<stdio.h>

int main(void) {
	int arr[10] = {0};
	int *p1;

	p1 = arr; /* в случая не е нужно да използваме &, защото името на масива представлява pointer, който сочи към неговия първи елемент на позиция 0 */
	p1 = &arr[0]; /* можем да го изпишем  и така */

	return 0;
}