/* Задача 8.Дефинирайте едномерен масив int с 10 елемента =
{100,90,80,70,60,50,40,30,20,10} Дефинирайте пойнтер, който ще сочи към
масива.
Достъпете 3 тия елемент от масива и му задайте стойност 5.
Достъпете 4 тия елемент и му задайте стойност 33.
Достъпете 5 тия елемент и го намалете със 7.
Достъпете 7 мия елемент и го увеличете с 10.
Достъпете 10 тия елемент и го умножете по 3.
Изпишете го по двата възможни начина и закоментирайте единия.
Принтирайте на екрана всички елементи на масива. */
#include<stdio.h>
#define arrayLength 10

int main(void) {
	int i;
	int arr1[arrayLength] = {100, 90, 80, 70, 60, 50, 40, 30, 20, 10};
	int *ptr1 = arr1;

	/* 3rd element, arr1[3] = 5 */
	*(ptr1 + 2) = 5;
	/* 4th element, arr[4] = 33; */
	*(ptr1 + 3) = 33;
	/* 5th element, arr[5] -= 7; */
	*(ptr1 + 4) -= 7;
	/* 7th element, arr[7] += 10; */
	*(ptr1 + 6) += 10;
	/* 10th element, arr[10] *= 3; */
	*(ptr1 + 9) *= 3;

	for (i = 0; i < arrayLength; i++) {
		if (i == arrayLength - 1) {
			printf("%d", *ptr1); 
		} else {
			printf("%d, ", *ptr1); 
		}
		ptr1++;
	}

	return 0;
}