/* Задача 1. Напишете програма, която сумира всички елементи на масив
намиращи се на четна позиция:
int arr[10] = {23, 91, 36, 4, 9, 99, 87, 11, 2, 33};
Декларирайте пойнтер към първата нечетна позиция, инкрементирайте
пойнтера по подходящ начин, за да извършите сумирането. */
#include <stdio.h>
#define ARR_SIZE 10

int main(void) {
    int arr[ARR_SIZE] = {1, 2, 3, 4, 5, 6, 7, 8, 9, 10};
    int *p, sum, i;
    p = &arr[1];

    for (i = 1; i < ARR_SIZE; i += 2) {
        sum += *p;
        p += 2; 
    }

    printf("Sum: %d\n", sum);

    return 0;
}