/* Задача 4: 
В какъв ред ще се изпълнят операциите?
true = x&&y&x<<1;
Какво ще се принтира на екрана?
В какъв ред ще се изпълнят операциите?
true = x&&y^x<<1;
Какво ще се принтира на екрана? */
#include<stdio.h>

int main(void) {
	int trueVar;
	int x = 10;
	int y = 10;

	trueVar = x && y & x << 1; // Първо ще се изпълни x << 1, което е равно на 20. След това ще се изпълни y(което е 10) & 20(резултатът от x<<1), което прави 0. Накрая ще се изпълни x(което е 10) && 0 и резултатът ще е 0. 
	printf("%d\n", trueVar);
	
	trueVar = x && y ^ x << 1; // Аналогично на горното първо ще се изпълни bitwise операторът 10 << 1 (=20), после bitwise XOR 10 ^ 20 = 30. Накрая ще имаме 10 && 30 = 1. 
	printf("%d\n", trueVar);

	return 0;
}