/* Задача 3: имаме две променливи int x = 10; и int y = 10;
създайте две променливи int true, false; На true присвоете
резултата от инкрементирането на ++х плюс оператор логическо
ИЛИ поставен между х и у . Принтирайте резултата */
#include<stdio.h>

int main(void) {
	int x = 10;
	int y = 10;

	int trueVar, falseVar;
	trueVar = ++x + (x || y); // х ще бъде повдигнато с 1, след което ще се извърши сравнението в скоби и тъй като двете числа са положителни имам 1 || 1 -> 1. Накрая ще събере x = 11 + 1 = 12. 
	
	printf("trueVar = %d\n", trueVar);

	return 0;
}