/* Задача 7. Направете програма, в която инициализирате пойнтер към променлива и след това изчислявате сбор на променливата (използвайки пойнтера) + 5. Отпечатайте на екрана. */
#include <stdio.h>

int main(void) {
	int a = 2;
	int *p = &a;
	*p += 5;

	printf("Sum a + 5 = %d", a);

	return 0;
}