/* Задача 11. Напишете програма, която умножава 2 числа, като използва пойнтер-и. 
Пойнтер-ите не са страшни. Дефинират се като тип *Х и се използват като *Х. Както променливите, но със * отпред (и 1 наум!).
Продължение: Опитайте да умножите 2 променливи от различен тип, използвайки пойнтери. */
#include <stdio.h>

int main(void) {
	int a = 5;
	int b = 10;
	float c = 11.1;
	int *p1, *p2;
	p1 = &a;
	p2 = &b;
	float *p3 = &c;

	printf("multiplication a x b: %d\n", (*p1 * *p2));
	printf("multiplication diffrent types a x c: %.6f\n", (*p1 * *p3));


	return 0;
}