/* Задача 5.
Дефинирайте и инициализирайте int променлива = 34 и
пойнтер към нея.
Опитайте да ги разместите, като поредност (първо да е
пойнтерът, после променливата). */
#include <stdio.h>

int main(void) {
	int *p1;
	int a = 34;
	p1 = &a;
	printf("a: %d address of a: %p\n", a, &a);
	printf("p: %d address of p: %p\n", *p1, p1);
	/* Ако ги разместим, пойнтерът ще сочи към променлива, която не е дефинирана и ще имаме грешка */

	/* Можете ли да умножите пойнтер по пойнтер? При тази декларация колко пойнтера имаме:int *p, k; */
	int *p, k; /* имаме само един пойнтер и това е *p. В случая к е от тип int и не е пойнтер */

	

	return 0;
}