/* Задача 10. Как работи? Дефинираме променлива “а“, дефинираме пойнтер, но още не му задаваме стойност. Отпечатайте адреса на “а”. След това присвояваме стойност на пойнтера, като внимаваме типовете на пойнтера и променливата да са от един и същи тип. Отпечатваме на екрана стойността на пойнтера с %р, стойността на „а“ с %d, стойността на *ptr с %d.
 */
#include <stdio.h>

int main(void) {
	int a = 110;
	int *p = NULL;
	p = &a;

	printf("address of a: %p\n", &a);
	printf("address of p: %p\n", p);
	printf("value of a: %d\n", a);
	printf("value of p: %d\n", *p);


	

	return 0;
}