/* Задача 9. Дефинирайте и инициализирайте променлива „а“.
Пойнтер към пойнтер към променлива.
Дефинирайте и инициализирайте пойнтер към нея.
Дефинирайте и инициализирайте пойнтер към първия пойнтер. Задайте
стойност на втория пойнтер 15.
Колко е стойността на променливата „а“?
Вземете бележката от масата, на нея пише в кое чекмедже (на скрина)
ще намерите бележката, на която пише къде е палтото (в гардероба);
Обърнете внимание на броя на звездичките! */
#include <stdio.h>

int main(void) {
	int a = 0;

	int *p1 = &a;
	int **p2 = &p1;
	**p2 = 15;

	printf("address of a: %p a: %d\n", &a, a);
	printf("address of p1: %p p1: %d\n", &p1, *p1);
	printf("address of p2: %p p2: %d\n", &p2, **p2);

	return 0;
}