/* Задача 4.
Дефинирайте пойнтер и опитайте да отпечатате стойността
му на конзолата (%р) с printf.
Какво се визуализира? */
#include <stdio.h>

int main(void) {
	int *p1;
	printf("%p ", p1); /* визуализира се адресът на пойнтера */


	return 0;
}