/* Задача 7.8. Създайте безкраен цикъл с for (;;) и принтирайте числото,
което на всеки цикъл се увеличава с едно. Когато числото стигне 48,
излезте от цикъла с break. */
#include<stdio.h>

int main(void) {
	int n = 0;

	for (;;) {
		printf("%d\n", n);
		n++;
		if (n == 48) {
			break;
		}
		
	}
	

	return 0;
}