/* Задача 7.7.Използвайте функцията getchar(), с която въвеждате
текст от клавиатурата, докато не подадете ЕОF(Ctrl+D). Текстът
има букви и цифри. Пребройте колко са въведените букви и
колко са въведените цифри. Определeте броя на цифрите в
стринга, като използвате оператор continue. */
#include <stdio.h>
int main()
{
	int c;
	int count;

	while ((c = getchar()) != EOF)
		if ((c >= 'A') && (c <= 'Z') ||
			(c >= 'a') && (c <= 'z'))
			count++;

	printf("%d letters\n", count);
}