/* Задача 9*. Напишете програма, която пресмята колко символа има в един
низ преди края на низа, обозначен със символа ‘\0’. Как трябва да изглежда
програмата:
1. Декларираме и инициализираме един низ - char s[ ] = “Hi”;
2. Декларираме и инициализираме променлива i, която ще увеличаваме
всеки път, когато искаме да видим следващия символ от низа “Hi”.
3. Принтираме съответната буква от низа printf(“%c”, s[i]);
4. Принтирайте броя на буквите в низа. */
#include <stdio.h>

int lenStr(char s[]);

int main(void) {
    char hi[] = "Hi";
    char string1[] = "Some random string.";

    printf("Len1: %d\n", lenStr(hi));
    printf("Len2: %d\n", lenStr(string1));

    return 0;
}

int lenStr(char s[]) {
    int i = 0;
    while (s[i] != 0) {
        i++;
    }

    return i;
}